# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 
# chislo = input("Введите трехзначное число: ")
# sum = 0
# for i in range(len(chislo)):
#     s = chislo[i]
#     s = int(s)
#     sum += s
# print(sum)